{
	"i18Footer": {
			"copyright": "Copyright © {{year}} Origin Data Global Limited, All rights reserved."
	},
	"i18Ueditor": {
			"UeditorAboutUs": "<p><span style=\"font-family: Arial;\">Origin Data full name: Origin Data Global Limited.</span></p><p><span style=\"font-family: Arial;\">&nbsp;</span></p><p><span style=\"font-family: Arial;\">Origin Data is a leading independent distributor of </span><a href=\"https://www.origin-ic.com/blog/What-are-Electronic-Components-/179\" target=\"_self\" textvalue=\"electronic components\"><span style=\"font-family: Arial;\">electronic components</span></a><span style=\"font-family: Arial;\">. Our primary focus is assisting customers in sourcing obsolete, end-of-life, hard-to-find and commonly used parts. Drawing on our extensive network and industry expertise, we provide timely, reliable </span><a href=\"https://www.origin-ic.com/quote\" target=\"_self\" textvalue=\"quotes\"><span style=\"font-family: Arial;\">quotes</span></a><span style=\"font-family: Arial;\"> for hard-to-source electronic components and peripherals, ensuring fast delivery that our customers can rely on.</span></p><p><span style=\"font-family: Arial;\">&nbsp;</span></p><p><span style=\"font-family: Arial;\">At Origin Data, our stores display </span><a href=\"https://www.origin-ic.com/products\" target=\"_self\" textvalue=\"millions of parts\"><span style=\"font-family: Arial;\">millions of parts</span></a><span style=\"font-family: Arial;\"> to meet the diverse needs of our loyal global OEM customer base. Our commitment to excellent customer service and market flexibility has earned us an excellent reputation in the industry.</span></p><p><span style=\"font-family: Arial;\">&nbsp;</span></p><p><span style=\"font-family: Arial;\">One of our core strengths lies in our strict quality assurance (QA) system and professional </span><a href=\"https://www.origin-ic.com/quality\" target=\"_self\" textvalue=\"quality control (QC)\"><span style=\"font-family: Arial;\">quality control (QC)</span></a><span style=\"font-family: Arial;\"> team. We work together to ensure that our products and services meet the highest quality standards. To further validate our commitment to quality, we are proud to be members of </span><a href=\"https://www.origin-ic.com/page/certifications\" target=\"_self\" textvalue=\"ERAI\"><span style=\"font-family: Arial;\">ERAI</span></a><span style=\"font-family: Arial;\"> and hold certifications such as </span><a href=\"https://www.origin-ic.com/page/certifications\" target=\"_self\" textvalue=\"ESD, AS9120B, ISO9001, ISO14001\"><span style=\"font-family: Arial;\">ESD, AS9120B, ISO9001, ISO14001</span></a><span style=\"font-family: Arial;\"> and more.</span></p><p><span style=\"font-family: Arial;\">&nbsp;</span></p><p><span style=\"font-family: Arial;\">What sets us apart is our experienced staff who have deep industry knowledge and years of experience in the field. This allows us to work closely with our customers to understand their unique needs and provide tailor-made solutions.</span></p><p><span style=\"font-family: Arial;\">&nbsp;</span></p><p><span style=\"font-family: Arial;\">At Origin Data, we strive to exceed our customers&#39; expectations, provide exceptional service, and meet all of your electronic component needs.</span></p>",
			"ManufacturersDes": "<p><span style=\"color: rgb(85, 85, 85); font-size: 16px; text-wrap: wrap;\">Origin Data Global Limited is a broad-line independent distributor of electronic components. We are dedicated to helping design engineers and procurement professionals easily select the</span><a href=\"https://www.origin-ic.com/products\" target=\"_self\" textvalue=\"&nbsp;products&nbsp;\"><span style=\"font-size: 16px;\">&nbsp;products&nbsp;</span></a><span style=\"color: rgb(85, 85, 85); text-wrap: wrap; font-size: 16px;\">t</span><span style=\"color: rgb(85, 85, 85); font-size: 16px; text-wrap: wrap;\">hey need and find detailed information to help with the qualification process. If you can’t find what you are looking for, our product experts are only email away.</span></p>",
			"UeditorNotice": "<p><span style=\"font-size: 14px;\"><strong><br/></strong></span></p><p><span style=\"font-size: 14px;\"><strong>Origin&nbsp;Data&nbsp;Global&nbsp;Limited&nbsp;2024&nbsp;National&nbsp;Day&nbsp;Holiday&nbsp;Notice</strong></span></p><p><br/></p><p>Dear&nbsp;Customers,</p><p><br/></p><p>Thank&nbsp;you&nbsp;for&nbsp;your&nbsp;continued&nbsp;support&nbsp;of&nbsp;Origin&nbsp;Data&nbsp;Global&nbsp;Limited.&nbsp;In&nbsp;celebration&nbsp;of&nbsp;the&nbsp;2024&nbsp;National&nbsp;Day,&nbsp;we&nbsp;would&nbsp;like&nbsp;to&nbsp;inform&nbsp;you&nbsp;of&nbsp;our&nbsp;holiday&nbsp;schedule:</p><p><br/></p><p><strong><span style=\"font-size: 14px;\">Holiday&nbsp;Schedule:</span></strong></p><p><br/></p><ul class=\" list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p><span style=\"text-wrap: wrap;\">Holiday&nbsp;Dates:&nbsp;October&nbsp;1,&nbsp;2024&nbsp;(Tuesday)&nbsp;to&nbsp;October&nbsp;7,&nbsp;2024&nbsp;(Monday)</span></p></li><li><p><span style=\"text-wrap: wrap;\">Normal&nbsp;Operations&nbsp;Resume:&nbsp;October&nbsp;8,&nbsp;2024&nbsp;(Tuesday)</span></p></li></ul><p><span style=\"text-wrap: wrap;\"></span></p><p></p><p><span style=\"text-wrap: wrap;\">During&nbsp;this&nbsp;period,&nbsp;our&nbsp;website&nbsp;will&nbsp;remain&nbsp;open&nbsp;for&nbsp;orders.&nbsp;However,&nbsp;please&nbsp;be&nbsp;aware&nbsp;that&nbsp;order&nbsp;processing&nbsp;and&nbsp;customer&nbsp;service&nbsp;responses&nbsp;may&nbsp;experience&nbsp;some&nbsp;delays.&nbsp;We&nbsp;appreciate&nbsp;your&nbsp;understanding.</span></p><p><span style=\"text-wrap: wrap;\"><br/></span></p><p><span style=\"text-wrap: wrap;\">Wishing&nbsp;you&nbsp;a&nbsp;happy&nbsp;National&nbsp;Day&nbsp;and&nbsp;enjoyable&nbsp;shopping!</span></p><p><span style=\"text-wrap: wrap;\"><br/></span></p><p><strong><span style=\"text-wrap: wrap; font-size: 14px;\">Origin&nbsp;Data&nbsp;Global&nbsp;Limited</span></strong></p><p><span style=\"text-wrap: wrap;\"><br/></span></p><p><span style=\"text-wrap: wrap;\">Date:&nbsp;September&nbsp;30,&nbsp;2024</span></p><p><span style=\"text-wrap: wrap;\"><br/></span></p><p><span style=\"text-wrap: wrap;\"></span></p><p><span style=\"text-wrap: wrap;\"></span></p>"
	},
	"i18Head": {
			"aboutUs": "About Us",
			"manufacturer": "Manufacturers",
			"products": "Products",
			"quality": "Quality",
			"resources": "Resources",
			"resourcesDes": "Our diverse network allows us to supply electronic components for a variety of industries, including automotive, consumer products, contract manufacturers, electronic manufacturing services (EMS), energy systems and controls, industrial automation, measurement technology, medical devices, telecommunications and welding."
	},
	"i18Seo": {
			"historyQuote": {
					"title": "Quote Request history | Origin Data Electronics",
					"keywords": "origin data quote request history, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "View historical quote records at Origin Data."
			},
			"ordersHistroy": {
					"title": "Orders Histroy | Origin Data Electronics",
					"keywords": "orders histroy, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Orders Histroy. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"savedCartDetail": {
					"title": "Saved Cart Detail | Origin Data Electronics",
					"keywords": "origin data cart detail, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Quickly view related product information through saved shopping cart list details. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"addresses": {
					"title": "Addresses | Origin Data Electronics",
					"keywords": "addresses, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Easily manage address information and support multiple address saving and selection."
			},
			"savedCarts": {
					"title": "Saved Carts | Origin Data Electronics",
					"keywords": "origin data carts center, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Customize multiple shopping cart categories to quickly view related product information. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"videos": {
					"title": "Videos | Origin Data Electronics",
					"keywords": "origin data videos, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Quickly learn product information by browsing videos. Origin Data offers tens of millions of products from thousands of the world's top manufacturers."
			},
			"blog": {
					"title": "Blog | Origin Data Electronics",
					"keywords": "origin data blog, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Gain insights into Origin Data through a diverse range of content, including blogs, technology and product reviews, projects, teardowns, and educational articles."
			},
			"recommendedProducts": {
					"title": "{{manufacturerName}}Recommended Products | Origin Data Electronics",
					"keywords": "{{manufacturerName}}origin data recommended products, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics - Daily and weekly recommendations from{{manufacturerName}}, from a wide range of products. Order now! Ships today."
			},
			"inventorySolutions": {
					"title": "Inventory Solutions | Origin Data Electronics",
					"keywords": "origin data inventory solutions, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Looking to transfer excess or surplus electronic component inventory? Origin Data is interested. Simply provide us with your excess electronic components via phone, fax, or email, and we will contact you the same day with the best cash offer."
			},
			"terms": {
					"title": "Terms And Conditions | Origin Data Electronics",
					"keywords": "origin data terms and conditions, origin data electronics, origin data global limited, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "View Origin Data's terms of use and conditions of order."
			},
			"customerReference": {
					"title": "Customer Reference | Origin Data Electronics",
					"keywords": "customer reference, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Customer Reference. The customer enters the Customer Reference to identify the product classification. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"subscriptionPreferences": {
					"title": "Subscription Preferences | Origin Data Electronics",
					"keywords": "subscription preferences, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Subscription Preferences. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"userInformation": {
					"title": "User Information | Origin Data Electronics",
					"keywords": "user Information, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "User Information. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"hotProducts": {
					"title": "{{manufacturerName}}Hot Products | Origin Data Electronics",
					"keywords": "{{manufacturerName}}origin data hot products, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics - Daily and Weekly{{manufacturerName}} Best Selling Products from a Wide Range of Products. Order Now! Ships Today."
			},
			"bomDetail": {
					"title": "Bom Detail | Origin Data Electronics",
					"keywords": "origin data bom detail, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "View historical BOM information through the BOM list. Origin Data offers tens of millions of products from thousands of the world's top manufacturers."
			},
			"Compare": {
					"title": "Compare {{model}} | Origin Data Electronics",
					"keywords": "{{model}}, {{classification}}electronic components supplier, electronic components distributor",
					"description": "Compare Products: {{model}}, quickly learn detailed information about each product by comparing products. Order now! Ships immediately."
			},
			"productsHome": {
					"title": "Find Electronic Components | Origin Data Electronics",
					"keywords": "electronic parts catalog, origin data electronics, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers",
					"description": "Origin Data for tens of millions of products from thousands of the world's top manufacturers. Find electronic component, Search electronic component datasheets, live inventory and prices."
			},
			"newsroom": {
					"title": "Newsroom | Origin Data Electronics",
					"keywords": "origin data newsroom, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Stay up to date in the Origin Data newsroom and stay up to date on the latest happenings at Origin Data."
			},
			"savedProject": {
					"title": "Saved Project | Origin Data Electronics",
					"keywords": "origin data project center, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Through the saved project list details, you can quickly view related product information. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"contactUs": {
					"title": "Contact Us | Origin Data Electronics",
					"keywords": "origin data contact us, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Contact Origin Data and send us your inquiries - we are happy to provide support."
			},
			"packageTracking": {
					"title": "Package Tracking | Origin Data Electronics",
					"keywords": "origin data package tracking, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data provides real-time status of orders, from order placement to delivery. Order now! Fast delivery."
			},
			"freeSample": {
					"title": "Free Sample Request | Origin Data Electronics",
					"keywords": "origin data free sample request, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data supports small batch production testing and provides free electronic component samples."
			},
			"productsList": {
					"title": "Electronic Parts Index | Origin Data Electronics",
					"keywords": "origin data electronic parts index, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronic Parts Index provides pricing on millions of products from thousands of top manufacturers around the world, Datasheet. Order now! Fast delivery."
			},
			"environmental": {
					"title": "Environmental | Origin Data Electronics",
					"keywords": "origin data environmental, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data is dedicated to continuous improvement of processes that impact the environment, aiming to enhance environmental performance."
			},
			"shippingRates": {
					"title": "Shipping Rates | Origin Data Electronics",
					"keywords": "origin data shipping rates, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data offers fast shipping worldwide. View estimated shipping costs by selecting your country. Order now! Fast delivery."
			},
			"manufacturerHome": {
					"title": "Supplier Line Card | Origin Data Electronics",
					"keywords": "electronic component manufacturers, origin data electronics, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Origin Data offers the supply of electronic components such as Integrated Circuits(ICs), capacitors, Isolators, connectors, and more from thousands of top manufacturers worldwide. Immediate delivery available."
			},
			"savedProjectDetail": {
					"title": "Saved Project Detail | Origin Data Electronics",
					"keywords": "origin data project detail, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Through the saved project list details, you can quickly view related product information. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"discountProducts": {
					"title": "{{manufacturerName}}Discount Products | Origin Data Electronics",
					"keywords": "{{manufacturerName}}origin data discount products, discount products, special products, preferential products, origin electronic parts mall",
					"description": "Origin Data Electronics - Daily and weekly{{manufacturerName}} discounts on a wide range of products. Order now! Ships today."
			},
			"bomQuote": {
					"title": "BOM Quote | Origin Data Electronics",
					"keywords": "origin data bom quote, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "it's even easier with the BOMs tool, Origin Data is ready for you to check the price and availability of millions of electronic components."
			},
			"quality": {
					"title": "Quality Policy | Origin Data Electronics",
					"keywords": "origin data electronics, origin data global limited, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Committed to safety and compliance, quality is at the core of Origin Data. As a member of ERAI and certified in ESD, AS9120B, ISO9001, and other standards, we have stringent measures in place to control the quality of our products and services."
			},
			"contentSearch": {
					"title": "Electronic Component Information and Resources | Origin Data Electronics",
					"keywords": "origin data electronic component information and resources, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Browse and search Technology Resource Center on the Origin Data site to explore articles, product highlights, the latest products, and reference designs related to electronic components and the electronics industry."
			},
			"popularManufacturers": {
					"title": "Popular Manufacturers | Origin Data Electronics",
					"keywords": "popular manufacturers, electronic component manufacturers, origin data electronics, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics supplies electronic components from thousands of top manufacturers worldwide, with Popular Manufacturers listing the leading companies in the industry."
			},
			"productsCatalogMore": {
					"title": "{{reverseAllCatalogName}} | Origin Data Electronics",
					"keywords": "{{reverseAllCatalogName}}",
					"description": "{{allCatalogName}} - Origin Data provides real-time inventory updates and pricing. order now, {{oneCatalogName}} ship quickly."
			},
			"careers": {
					"title": "Careers | Origin Data Electronics",
					"keywords": "origin data careers, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Explore exciting career opportunities at Origin Data. Join our dynamic team and take your career to new heights. Apply now!"
			},
			"browseHistory": {
					"title": "Browse History | Origin Data Electronics",
					"keywords": "browse history, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "View detailed information about browsed products through browsing history. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"seriesNumberDetail": {
					"title": "{{upperSeriesName}} Series {{manufacturerName}} | Origin Data Electronics",
					"keywords": "{{upperSeriesName}} Series, {{manufacturerName}}, electronic components supplier, electronic components distributor, electronic parts store",
					"description": "Origin Data offers a product line from {{manufacturerName}}, a top global manufacturer. Origin is a member of ERAI. Order now! Fast delivery."
			},
			"newestProducts": {
					"title": "{{name}}Newest Products | Origin Data Electronics ",
					"keywords": "{{name}}electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics - Newest{{name}} products are released every day and every week, with a wide range of products. Order now! Fast delivery."
			},
			"orders": {
					"title": "Order | Origin Data Electronics",
					"keywords": "order, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Order. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"siteMap": {
					"title": "Site Map | Origin Data Electronics",
					"keywords": "origin data site map, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data offers tens of millions of products from thousands of top manufacturers worldwide. Origin is a member of ERAI. Order now! Fast delivery."
			},
			"vatNumber": {
					"title": "Vat Number | Origin Data Electronics",
					"keywords": "vat number, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Vat Number. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"favorites": {
					"title": "Favorites | Origin Data Electronics",
					"keywords": "favorites, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Favorites. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"aboutUs": {
					"title": "About Origin Data Global Limited",
					"keywords": "origin data global limited, origin data electronics, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Origin Data offers electronic component supplies from thousands of top manufacturers worldwide. As one of the fastest-growing electronic component distributors globally, we provide immediate delivery options."
			},
			"requestQuote": {
					"title": "Request a Quote | Origin Data Electronics",
					"keywords": "origin data request a quote, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data is ready for you to check the price and availability of millions of electronic components; it's even easier with the BOMs tool."
			},
			"retrievePassword": {
					"title": "Retrieve Password | Origin Data Electronics",
					"keywords": "origin data retrieve password, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Retrieve passwords and update passwords quickly through email authentication information. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"applicationNotes": {
					"title": "Application Notes | Origin Data Electronics",
					"keywords": "origin data application notes, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Learn more about product information by browsing application notes. Origin Data offers tens of millions of products from thousands of the world's top manufacturers."
			},
			"productsListDetail": {
					"title": "Electronic Parts Index {{firstLetter}} | Origin Data Electronics",
					"keywords": "electronic parts index {{firstLetter}}, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronic Parts Index {{firstLetter}} provides pricing, datasheets for millions of products from thousands of top manufacturers around the world. Order now! Fast delivery."
			},
			"login": {
					"title": "Log In | Origin Data Electronics",
					"keywords": "origin data electronics, origin data global limited, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Log in to Origin Data account. Origin Data Electronic Parts Index provides pricing on millions of products from thousands of top manufacturers around the world, Datasheet."
			},
			"helpCenter": {
					"title": "Help Center | Origin Data Electronics",
					"keywords": "origin data help center, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "We are more than happy to assist you! Origin Data's online help center can provide assistance with placing orders, shipping, delivery, and other related inquiries."
			},
			"productHighlights": {
					"title": "Product Highlights | Origin Data Electronics",
					"keywords": "origin data product highlights, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Check out the newest additions to Origin Data extensive inventory of electronic components. Place your order online today!"
			},
			"shoppingCart": {
					"title": "Shopping Cart | Origin Data Electronics",
					"keywords": "shopping cart, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Shopping Cart. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"quickOrder": {
					"title": "Quick Order | Origin Data Electronics",
					"keywords": "origin data quick order, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data offers tens of millions of products from thousands of the world's top manufacturers. Customers operate through quick orders, place orders now! Shipping today."
			},
			"freightAccounts": {
					"title": "Freight Accounts | Origin Data Electronics",
					"keywords": "freight accounts, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Freight Accounts. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"productsDetail": {
					"title": "{{partNumber}} {{manufacturer}} / {{oneCatalogName}} | Origin Data Electronics",
					"keywords": "{{partNumber}}, {{manufacturer}}, {{lastCatalogName}}, origin data electronics, electronic components distributor",
					"description": "{{partNumber}} - From Manufacturer: {{manufacturer}}, it is an {{description}}, part of {{allCatalogName}}. {{hotProducts}} {{partNumber}} stock status: In stock; order now! Ships immediately."
			},
			"quoteHistory": {
					"title": "Quote History | Origin Data Electronics",
					"keywords": "quote history, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Quote History. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"coupon": {
					"title": "Voucher | Origin Data Electronics",
					"keywords": "Voucher, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Use Vouchers at checkout to get discounts. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"privacyPolicy": {
					"title": "Privacy Policy | Origin Data Electronics",
					"keywords": "origin data privacy, origin data electronics, origin data global limited, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Learn about Origin Data policy for collecting, using and protecting the personal data of our customers."
			},
			"allTagsDetails": {
					"title": "{{tag}} | Origin Data Electronics",
					"keywords": "{{tag}}electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "{{tag}}Origin Data Electronics provides articles and knowledge about the electronic components industry, and you can quickly find the corresponding articles by filtering by tags."
			},
			"manufacturerCategory": {
					"title": "Manufacturers By Product Category | Origin Data Electronics",
					"keywords": "manufacturers by product category, electronic component manufacturers, origin data electronics, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics supplies electronic components from thousands of top manufacturers worldwide, allowing for quick searches of corresponding manufacturer names by category."
			},
			"certifications": {
					"title": "Certifications | Origin Data Electronics",
					"keywords": "origin data certifications, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data is committed to safety and compliance, with a core value of continuous improvement and quality. We strive to enhance our operations, development, and delivery efforts. We have obtained ERAI membership and certifications such as AS9120B."
			},
			"sampleList": {
					"title": "Sample List | Origin Data Electronics",
					"keywords": "sample list, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Sample List. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"seriesNumber": {
					"title": "Series Number | Origin Data Electronics",
					"keywords": "origin data series number, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "View all series product information through the product base model of the series classification. Origin Data offers tens of millions of products from thousands of the world's top manufacturers."
			},
			"changePassword": {
					"title": "Change Password | Origin Data Electronics",
					"keywords": "change password, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Quickly change your password through email authentication. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"home": {
					"title": "Electronic Components Distributor - Origin Data Electronics",
					"keywords": "origin data, origin data electronics, electronic components distributor, electronic parts mall, electronic components wholesale",
					"description": "Electronic Components Distributor - Origin Data Electronics offers tens of millions of products from thousands of top manufacturers worldwide. Leading electronic component distributor, providing electronic component datasheets, real-time inventory and pricing."
			},
			"productsCatalog": {
					"title": "Integrated Circuits (ICs) | Origin Data Electronics",
					"keywords": "{{oneCatalogName}}",
					"description": "{{oneCatalogName}} - Origin Data provides real-time inventory updates and pricing. order now, {{oneCatalogName}} ship quickly."
			},
			"savedBoms": {
					"title": "Saved Boms | Origin Data Electronics",
					"keywords": "saved boms, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Saved Boms. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"Unclassified": {
					"title": "Unclassified product | Origin Data Electronics",
					"keywords": "origin data electronics, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data Electronics supplies electronic components for all industries, distributing products from major manufacturers worldwide. Order now! Fast delivery."
			},
			"orderDetail": {
					"title": "Order Detail | Origin Data Electronics",
					"keywords": "order detail, origin electronic parts mall, find electronic components, Electronic components distributor",
					"description": "Order Detail. Origin Data offers tens of millions of electronic component products from thousands of the world's top manufacturers."
			},
			"allTags": {
					"title": "All Tags {{firstLetter}} | Origin Data Electronics",
					"keywords": "origin data news tabs, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Tags for all electronic components content, you can quickly filter detailed content parts through tags."
			},
			"manufacturerDetail": {
					"title": "{{manufacturerName}} | Origin Data Electronics",
					"keywords": "{{name}}, electronic components supplier, electronic components distributor, electronic parts store, electronic parts suppliers",
					"description": "Origin Data is an distributor of {{manufacturerName}}, ranging from {{topFiveNames}} solutions."
			},
			"register": {
					"title": "Register | Origin Data Electronics",
					"keywords": "origin data electronics, origin data global limited, electronic components supplier, electronic components distributor, electronic components wholesale, electronic parts distributor, find electronic components, electronic parts store, electronic parts suppliers, electronic parts catalog",
					"description": "Register Origin Data account. The Origin Data Electronic Parts Index provides pricing, datasheets for millions of products from thousands of the world's top manufacturers."
			}
	},
	"i18CompanyInfo": {
			"address": "15F, Hangdu Bldg,No.1006 Huafu Road, Shenzhen, China",
			"Company Address": ""
	},
	"i18MenuText": {},
	"i18FunBtnText": {}
}